Resources/views/Gateway/soap/eureka_score.xml.twig

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:cb4x="http://www.cb4x.fr"
    xmlns:sch="http://www.scheduled-payment.fr/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <cb4x:Score>
            <cb4x:header>
                <cb4x:Context>
                    <cb4x:MerchantId>{{ Header.Context.MerchantId }}</cb4x:MerchantId>
                    <cb4x:MerchantSiteId>{{ Header.Context.MerchantSiteId }}</cb4x:MerchantSiteId>
                </cb4x:Context>
                <cb4x:Localization>
                    <cb4x:Country>{{ Header.Localization.Country }}</cb4x:Country>
                    <cb4x:Currency>{{ Header.Localization.Currency }}</cb4x:Currency>
                    <cb4x:DecimalPosition>{{ Header.Localization.DecimalPosition }}</cb4x:DecimalPosition>
                    <cb4x:Language>{{ Header.Localization.Language }}</cb4x:Language>
                </cb4x:Localization>
                <cb4x:SecurityContext>
                    <cb4x:DomainRightsList/>
                    <cb4x:IssuerID xsi:nil="true"/>
                    <cb4x:SessionID xsi:nil="true"/>
                    <cb4x:SubjectLocality/>
                    <cb4x:TokenId>{{ Header.SecurityContext.TokenId }}</cb4x:TokenId>
                    <cb4x:UserName xsi:nil="true"/>
                </cb4x:SecurityContext>
                <cb4x:Version>{{ Header.Version }}</cb4x:Version>
            </cb4x:header>
            <cb4x:request>
                {% for request_key, request_value in Request %}
                {% if request_value is not null or (request_value is iterable and request_value is not empty) %}
                <cb4x:{{ request_key }}>
                    {% for field_key, field_value in request_value %}
                        {% if field_value is iterable %}
                            {% for sub_field_key, sub_field_value in field_value %}
                        {% if sub_field_value is null %}<sch:{{ sub_field_key }} xsi:nil="true"/>{% else %}<sch:{{ sub_field_key }}>{{ sub_field_value }}</sch:{{ sub_field_key }}>{% endif %}
                            {% endfor %}
                        {% elseif field_value is null %}
                        <sch:{{ field_key }} xsi:nil="true"/>
                        {% else %}
                        <sch:{{ field_key }}>{{ field_value }}</sch:{{ field_key }}>
                        {% endif %}
                    {% endfor %}
                </cb4x:{{ request_key }}>
                {% endif %}
                {% endfor %}
            </cb4x:request>
        </cb4x:Score>
    </soapenv:Body>
</soapenv:Envelope>
